Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/money_and_tax/personal_finance/debt/personal_insolvency/what_is_bankruptcy.html.txt.tmx
Source language: en
Languages: ga

source: When applying to be declared bankrupt, you must pay €200 to the Official Assignee
ga: Nuair a dhéanann tú iarratas go ndearbhófar i d’fhéimheach thú, ní mór duit €200 a íoc leis an Sannaí Oifigiúil

source: There is no stamp duty payable to the Courts Stamp office for the petition, or for the sworn affidavit (incorporating a Statement of Affairs)
ga: Níl ort dleacht stampála a íoc ar an achainí ná ar an mionnscríbhinn faoi mhionn (a chuimsíonn Ráiteas Gnóthaí)

source: The charge for swearing of an affidavit before a Commissioner of Oaths is set out in S.I
ga: Leagtar amach an muirear ar mhionnscríbhinn a mhionnú os comhair Coimisinéir Mionnaí in I.R

source: 616/2003 - Rules of the Superior Courts (Fees Payable To Commissioners For Oaths), 2003
ga: 616/2003 – Rialacha na nUaschúirteanna (Táillí Iníoctha le Coimisinéirí Mionnaí), 2003

source: A notice in Iris Oifigiúil costs between €45 and €75, depending on its length
ga: Cosnaíonn fógra in Iris Oifigiúil idir €45 agus €75, ag brath ar a fhad

source: There is no charge for advertising your bankruptcy on the ISI website
ga: Níl aon mhuirear ar d’fhéimheacht a fhógairt ar láithreán gréasáin SDÉ

source: Commercial rates apply if you place the advertisement in a national daily newspaper instead
ga: Bíonn rátaí tráchtála i gceist má chuireann tú fógra i nuachtán náisiúnta laethúil ina ionad sin

source: The cost of any professional advice can vary
ga: Féadfaidh costas aon chomhairle ghairmiúil a bheith éagsúil

source: As outlined in ‘Bankruptcy process and outcomes’ above, there are several steps that you have to take when applying to be made bankrupt
ga: Faoi mar a dtugtar breac-chuntas air sa mhír ‘An próiseas iarratais’ thuas, tá roinnt céimeanna ann nach mór duit tabhairt fúthu nuair a dhéanann tú iarratas go ndéanfar féimheach thú

source: The ISI’s website has the forms that you need and detailed notes on the process, as well as the Debtor's Guide to Bankruptcy (pdf)
ga: Tá ar láithreán gréasáin SDÉ na foirmeacha a theastaíonn uait, mar aon le treoir mhionsonraithe maidir leis an bpróiseas (pdf) agus leabhrán (pdf)

source: To start the process, you must lodge money to the Official Assignee, using the bank account listed in the Debtor's Guide
ga: Chun tús a chur leis an bpróiseas, ní mór duit airgead a chur i dtaisce don Sannaí Oifigiúil, agus an cuntas bainc atá liostáilte sa treoir a úsáid

source: You then email proof of the lodgment to the ISI’s Bankruptcy Division
ga: Ansin cuireann tú cruthúnas na lóisteála ar ríomhphost chuig Rannóg Féimheachta SDÉ

source: Consult the ISI's notes and guide for a detailed account of the next steps
ga: Téigh i gcomhairle na treorach chun teacht ar chuntas mionsonraithe ar na chéad chéimeanna eile

source: If you wish to be discharged from bankruptcy, you apply to the Examiner's Office
ga: Más mian leat a bheith díscaoilte ó fhéimheacht, déanann tú iarratas ar Oifig an Scrúdaitheora
